Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 129, 14, 32)       320       
                                                                 
 max_pooling2d (MaxPooling2  (None, 64, 7, 32)         0         
 D)                                                              
                                                                 
 conv2d_1 (Conv2D)           (None, 64, 7, 64)         18496     
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 32, 3, 64)         0         
 g2D)                                                            
                                                                 
 reshape (Reshape)           (None, 32, 192)           0         
                                                                 
 lstm (LSTM)                 (None, 64)                65792     
                                                                 
 dense (Dense)               (None, 64)                4160      
                                                                 
 dropout (Dropout)           (None, 64)                0         
                                                                 
 dense_1 (Dense)             (None, 1)                 65        
                                                                 
=================================================================
Total params: 88833 (347.00 KB)
Trainable params: 88833 (347.00 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
